Repository: abhinavm24/typewhisper-mac
Catalog: TypeWhisperPluginSDK/Plugins/CohereLocalPlugin/Localizable.xcstrings
Source language: en
Languages: de, ja, zh_hans

source: 14 languages with explicit selection: English, French, German, Spanish, Italian, Portuguese, Dutch, Polish, Greek, Arabic, Japanese, Chinese, Vietnamese, and Korean.
de: 14 Sprachen mit expliziter Auswahl: Englisch, Französisch, Deutsch, Spanisch, Italienisch, Portugiesisch, Niederländisch, Polnisch, Griechisch, Arabisch, Japanisch, Chinesisch, Vietnamesisch und Koreanisch.
ja: 対応する14言語から明示的に選択してください：英語、フランス語、ドイツ語、スペイン語、イタリア語、ポルトガル語、オランダ語、ポーランド語、ギリシャ語、アラビア語、日本語、中国語、ベトナム語、韓国語。
zh_hans: 14 种语言需明确选择：英语、法语、德语、西班牙语、意大利语、葡萄牙语、荷兰语、波兰语、希腊语、阿拉伯语、日语、中文、越南语和韩语。

source: A private on-device GGUF and Metal provider for Cohere Transcribe 03-2026. Audio stays on this Mac.
de: Ein privater GGUF- und Metal-Provider auf dem Gerät für Cohere Transcribe 03-2026. Audio bleibt auf diesem Mac.
ja: GGUFとMetalを使用してCohere Transcribe 03-2026をローカルで実行します。音声はこのMac内に留まります。
zh_hans: Cohere Transcribe 03-2026 的本地 GGUF 和 Metal 私有提供程序。音频数据保留在此 Mac 上。

source: Cancel
de: Abbrechen
ja: キャンセル
zh_hans: 取消

source: Capabilities and limits
de: Funktionen und Einschränkungen
ja: 機能と制限
zh_hans: 功能与限制

source: Cohere model license
de: Cohere-Modelllizenz
ja: Cohereモデルのライセンス
zh_hans: Cohere 模型许可

source: Cohere Transcribe (Local)
de: Cohere Transcribe (Lokal)
zh_hans: Cohere Transcribe（本地）

source: CrispASR license and notices
de: CrispASR-Lizenz und Hinweise
ja: CrispASRのライセンスと通知事項
zh_hans: CrispASR 许可与声明

source: Done
de: Fertig
ja: 完了
zh_hans: 完成

source: Download & Load
de: Herunterladen & Laden
ja: ダウンロードして読み込む
zh_hans: 下载并加载

source: Downloaded
de: Heruntergeladen
ja: ダウンロード済み
zh_hans: 已下载

source: Downloading
de: Wird heruntergeladen
ja: ダウンロード中
zh_hans: 正在下载

source: Downloading Cohere model
de: Cohere-Modell wird heruntergeladen
ja: Cohereモデルをダウンロード中
zh_hans: 正在下载 Cohere 模型

source: Error
de: Fehler
ja: エラー
zh_hans: 错误

source: Invalid Hugging Face Token
de: Ungültiger Hugging-Face-Token
ja: 無効なHugging Faceトークン
zh_hans: 无效的 Hugging Face 令牌

source: Load
de: Laden
ja: 読み込む
zh_hans: 加载

source: LOCAL · BATCH
de: LOKAL · BATCH
ja: ローカル · バッチ処理
zh_hans: 本地 · 批量

source: No automatic language detection, streaming, timestamps, diarization, translation, or dictionary boosting.
de: Keine automatische Spracherkennung, kein Streaming, keine Zeitstempel, Diarisierung, Übersetzung oder Wörterbuchverstärkung.
ja: 言語の自動検出、ストリーミング、タイムスタンプ、話者分離、翻訳、辞書による認識精度の向上には対応していません。
zh_hans: 不支持自动语言检测、流式传输、时间戳、说话人分离、翻译或词典增强。

source: Model weights are downloaded from a pinned Apache-2.0 GGUF revision. CrispASR and the VAD model are MIT-licensed.
de: Die Modellgewichte werden aus einer festgeschriebenen Apache-2.0-GGUF-Revision geladen. CrispASR und das VAD-Modell stehen unter der MIT-Lizenz.
ja: モデルの重みは、Apache-2.0ライセンスのGGUFの固定リビジョンからダウンロードされます。CrispASRとVADモデルはMITライセンスです。
zh_hans: 模型权重从固定的 Apache-2.0 GGUF 版本下载。CrispASR 和 VAD 模型采用 MIT 许可。

source: Not Downloaded
de: Nicht heruntergeladen
ja: 未ダウンロード
zh_hans: 未下载

source: Optional. Increases download rate limits and may speed up the model download. The token is stored securely in Keychain.
de: Optional. Erhöht die Download-Limits und kann den Modelldownload beschleunigen. Der Token wird sicher im Schlüsselbund gespeichert.
ja: 任意。ダウンロードのレート制限が緩和され、モデルのダウンロードが速くなる場合があります。トークンはキーチェーンに安全に保存されます。
zh_hans: 可选。提高下载速率限制并可能加速模型下载。令牌安全存储在钥匙串中。

source: Preparing
de: Wird vorbereitet
ja: 準備中
zh_hans: 准备中

source: Starting CrispASR with Metal and warming up the model. Dictation is ready when this finishes.
de: CrispASR wird mit Metal gestartet und das Modell wird aufgewärmt. Nach Abschluss ist die Diktierfunktion bereit.
ja: MetalでCrispASRを起動し、モデルの初期準備を行っています。完了すると音声入力を使用できます。
zh_hans: 正在使用 Metal 启动 CrispASR 并预热模型。完成后即可开始听写。

source: Ready
de: Bereit
ja: 準備完了
zh_hans: 就绪

source: Running Cohere locally with Metal…
de: Cohere läuft lokal mit Metal …
ja: MetalでCohereをローカル実行中…
zh_hans: 正在本地使用 Metal 运行 Cohere...

source: Remove
de: Entfernen
ja: 削除
zh_hans: 移除

source: Remove downloaded model?
de: Heruntergeladenes Modell entfernen?
ja: ダウンロード済みのモデルを削除しますか？
zh_hans: 移除已下载的模型？

source: Remove Model
de: Modell entfernen
ja: モデルを削除
zh_hans: 移除模型

source: Save
de: Speichern
ja: 保存
zh_hans: 保存

source: The model stays resident while loaded. Metal is warmed up before the provider becomes ready, keeping the first transcription responsive.
de: Das Modell bleibt geladen im Arbeitsspeicher. Metal wird aufgewärmt, bevor der Provider bereit ist, damit die erste Transkription schnell reagiert.
ja: モデルは読み込まれている間、メモリに常駐します。プロバイダーが使用可能になる前にMetalの初期準備を行うため、初回の文字起こしも速やかに開始できます。
zh_hans: 模型加载后将常驻内存。Metal 在提供程序就绪前完成预热，确保首次转录响应迅速。

source: Unload
de: Entladen
ja: アンロード
zh_hans: 卸载

source: Valid Hugging Face Token
de: Gültiger Hugging-Face-Token
ja: 有効なHugging Faceトークン
zh_hans: 有效的 Hugging Face 令牌

source: Validating token…
de: Token wird geprüft …
ja: トークンを検証中…
zh_hans: 正在验证令牌...

source: VAD model license
de: VAD-Modelllizenz
ja: VADモデルのライセンス
zh_hans: VAD 模型许可

source: Voice activity detection runs before every transcription to suppress silence and low-noise hallucinations.
de: Vor jeder Transkription läuft eine Sprachaktivitätserkennung, um Halluzinationen bei Stille und leisem Rauschen zu unterdrücken.
ja: 毎回の文字起こし前に音声区間を検出し、無音や小さなノイズによる誤認識を抑えます。
zh_hans: 每次转录前运行语音活动检测，以抑制静音和低噪声幻听。

source: 8 GB+ Mac
de: Mac mit mindestens 8 GB
ja: メモリ8 GB以上のMac
zh_hans: 8 GB 以上 Mac

source: 16 GB+ recommended
de: Mindestens 16 GB empfohlen
ja: メモリ16 GB以上を推奨
zh_hans: 建议 16 GB 以上

source: Best tested balance of size, speed, and accuracy
de: Bestes getestetes Verhältnis von Größe, Geschwindigkeit und Genauigkeit
ja: 検証した中で容量・速度・精度のバランスが最良
zh_hans: 经过测试的大小、速度和准确度的最佳平衡

source: Choose Compact Q4_K for the smallest download, Fast Q5_0 for the recommended default, Q6_K for higher numeric precision, or experimental Q8_0 for maximum numeric precision. Only the selected model is loaded.
de: Wähle Kompakt Q4_K für den kleinsten Download, Schnell Q5_0 als empfohlene Standardeinstellung, Q6_K für höhere numerische Präzision oder das experimentelle Q8_0 für maximale numerische Präzision. Nur das ausgewählte Modell wird geladen.
ja: ダウンロード容量が最小のCompact Q4_K、標準で推奨するFast Q5_0、数値精度が高いQ6_K、数値精度が最高の実験的なQ8_0から選択できます。選択したモデルだけを読み込みます。
zh_hans: 选择 Compact Q4_K 获得最小下载量，Fast Q5_0 作为推荐默认选项，Q6_K 获得更高数值精度，或实验性 Q8_0 获得最高数值精度。仅加载选定的模型。

source: Cohere asset verification failed for:
de: Cohere-Asset-Überprüfung fehlgeschlagen für:
ja: Cohereのファイル検証に失敗しました：
zh_hans: Cohere 资源验证失败：

source: Cohere Transcribe does not support translation.
de: Cohere Transcribe unterstützt keine Übersetzung.
ja: Cohere Transcribeは翻訳に対応していません。
zh_hans: Cohere Transcribe 不支持翻译。

source: Cohere Transcribe requires an explicitly selected supported language. Automatic language detection is not available. Supported languages:
de: Cohere Transcribe benötigt eine explizit ausgewählte unterstützte Sprache. Automatische Spracherkennung ist nicht verfügbar. Unterstützte Sprachen:
ja: Cohere Transcribeでは対応言語を明示的に選択する必要があります。言語の自動検出は利用できません。対応言語：
zh_hans: Cohere Transcribe 需要明确选择支持的语言。不支持自动语言检测。支持的语言：

source: Compact (Q4_K · Metal)
de: Kompakt (Q4_K · Metal)
zh_hans: 紧凑型（Q4_K · Metal）

source: CrispASR did not become ready within five minutes.
de: CrispASR war nicht innerhalb von fünf Minuten bereit.
ja: CrispASRが5分以内に使用可能になりませんでした。
zh_hans: CrispASR 未能在五分钟内就绪。

source: CrispASR exited while starting.
de: CrispASR wurde während des Starts beendet.
ja: CrispASRが起動中に終了しました。
zh_hans: CrispASR 在启动时退出。

source: Fast (Q5_0 · Recommended)
de: Schnell (Q5_0 · empfohlen)
ja: Fast (Q5_0 · 推奨)
zh_hans: 快速型（Q5_0 · 推荐）

source: Higher precision (Q6_K · Metal)
de: Höhere Präzision (Q6_K · Metal)
ja: 高精度 (Q6_K · Metal)
zh_hans: 更高精度（Q6_K · Metal）

source: Intermediate quantization between recommended Q5_0 and Q8_0
de: Mittlere Quantisierung zwischen dem empfohlenen Q5_0 und Q8_0
ja: 推奨のQ5_0とQ8_0の中間の量子化
zh_hans: 推荐 Q5_0 与 Q8_0 之间的中间量化级别

source: Largest quantization; no overall accuracy gain measured yet
de: Größte Quantisierung; bisher kein allgemeiner Genauigkeitsgewinn gemessen
ja: 容量が最大の量子化モデル。全体的な認識精度の向上は未確認
zh_hans: 最大量化；尚未测得整体准确度提升

source: Maximum precision (Q8_0 · Experimental)
de: Maximale Präzision (Q8_0 · experimentell)
ja: 最高精度 (Q8_0 · 実験的)
zh_hans: 最高精度（Q8_0 · 实验性）

source: Model
de: Modell
ja: モデル
zh_hans: 模型

source: Smallest download and memory footprint
de: Kleinster Download und geringster Speicherbedarf
ja: ダウンロード容量・メモリ使用量が最小
zh_hans: 最小下载量和内存占用

source: The Cohere model download completed without all required model files.
de: Der Download des Cohere-Modells wurde abgeschlossen, ohne dass alle erforderlichen Modelldateien vorhanden sind.
ja: Cohereモデルのダウンロードは完了しましたが、必要なモデルファイルが揃っていません。
zh_hans: Cohere 模型下载已完成，但缺少部分必需的模型文件。

source: The Cohere Transcribe model is not downloaded.
de: Das Cohere-Transcribe-Modell wurde nicht heruntergeladen.
ja: Cohere Transcribeモデルがダウンロードされていません。
zh_hans: Cohere Transcribe 模型尚未下载。

source: The Cohere Transcribe model is not loaded. Open the plugin settings and load it first.
de: Das Cohere-Transcribe-Modell ist nicht geladen. Öffne die Plugin-Einstellungen und lade es zuerst.
ja: Cohere Transcribeモデルが読み込まれていません。プラグイン設定を開き、先に読み込んでください。
zh_hans: Cohere Transcribe 模型尚未加载。请打开插件设置并先加载模型。

source: The CrispASR runtime could not be extracted.
de: Die CrispASR-Laufzeit konnte nicht entpackt werden.
ja: CrispASRランタイムを展開できませんでした。
zh_hans: 无法解压 CrispASR 运行时。

source: The CrispASR runtime download failed.
de: Die CrispASR-Laufzeit konnte nicht heruntergeladen werden.
ja: CrispASRランタイムのダウンロードに失敗しました。
zh_hans: CrispASR 运行时下载失败。

source: The local CrispASR server URL is invalid.
de: Die URL des lokalen CrispASR-Servers ist ungültig.
ja: ローカルのCrispASRサーバーURLが無効です。
zh_hans: 本地 CrispASR 服务器 URL 无效。

source: The pinned Cohere model repository identifier is invalid.
de: Die Kennung des festgeschriebenen Cohere-Modell-Repositorys ist ungültig.
ja: 固定されたCohereモデルのリポジトリ識別子が無効です。
zh_hans: 固定的 Cohere 模型仓库标识符无效。

source: The verified CrispASR runtime archive is incomplete.
de: Das überprüfte CrispASR-Laufzeitarchiv ist unvollständig.
ja: 検証済みのCrispASRランタイムアーカイブに不足があります。
zh_hans: 已验证的 CrispASR 运行时归档不完整。

source: This removes %@. Shared runtime files remain while another variant is installed.
de: Dadurch wird %@ entfernt. Gemeinsam genutzte Laufzeitdateien bleiben erhalten, solange eine andere Variante installiert ist.
ja: %@を削除します。別のバリアントがインストールされている間は、共有ランタイムファイルを保持します。
zh_hans: 这将移除 %@。如果安装了其他变体，共享运行时文件将保留。

source: TypeWhisper could not reserve a local port for Cohere Transcribe.
de: TypeWhisper konnte keinen lokalen Port für Cohere Transcribe reservieren.
ja: TypeWhisperがCohere Transcribe用のローカルポートを確保できませんでした。
zh_hans: TypeWhisper 无法为 Cohere Transcribe 预留本地端口。

source: Starting and warming up Cohere with Metal
de: Cohere wird mit Metal gestartet und aufgewärmt
ja: MetalでCohereを起動して初期準備中
zh_hans: 正在使用 Metal 启动并预热 Cohere

source: Working…
de: In Arbeit …
ja: 処理中…
zh_hans: 正在运行...

source: Loads on demand
de: Wird bei Bedarf geladen
ja: 必要時に読み込み
zh_hans: 按需加载

source: Auto-unload model is set to Immediate.
de: „Modell automatisch entladen“ steht auf „Sofort“.
ja: 「モデルを自動でアンロード」が「すぐに」に設定されています。
zh_hans: “自动卸载模型”已设为“立即”。

source: Hugging Face Token
ja: Hugging Faceトークン
zh_hans: Hugging Face 令牌
